# Loan Predication By Machine Learning

In [1]:
pwd

'C:\\Users\\SUBHAJIT\\Machine_Learning'

In [2]:
#importing necessary modules
import numpy as np
import pandas as pd

In [3]:
#datset into dataframe
df=pd.read_csv('train_u6lujuX_CVtuZ9i.csv')
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

### Preprocessing the dataset to make it compitable

In [4]:
#Checking the datatypes of the columns
df.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [5]:
df['Property_Area'].unique()

array(['Urban', 'Rural', 'Semiurban'], dtype=object)

In [6]:
df['Dependents'].unique()

array(['0', '1', '2', '3+', nan], dtype=object)

In [7]:
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [8]:
#Replacing the missing values and null values by mean values
df['Gender1']=np.where(df['Gender']=='Male',0,1)
df['Married1']=np.where(df['Married']=='Yes',0,1)
df['Dependents1']=np.where(df['Dependents']=='0',0,np.where(df['Dependents']=='1',1,np.where(df['Dependents']=='2',2,3)))
df['Self_Employed1']=np.where(df['Self_Employed']=='Yes',0,1)
df['Education1']=np.where(df['Education']=='Graduate',0,1)
df['Property_Area1']=np.where(df['Property_Area']=='Semiurban',0,np.where(df['Property_Area']=='Urban',1,2))
df['Loan_Status1']=np.where(df['Loan_Status']=='Y',0,1)
df['LoanAmount'].fillna(df['LoanAmount'].mean(), inplace = True)
df['Loan_Amount_Term'].fillna(df['Loan_Amount_Term'].mean(), inplace = True)
df['Credit_History'].fillna(df['Credit_History'].mean(), inplace = True)
df.head(5)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Gender1,Married1,Dependents1,Self_Employed1,Education1,Property_Area1,Loan_Status1
0,LP001002,Male,No,0,Graduate,No,5849,0.0,146.412162,360.0,1.0,Urban,Y,0,1,0,1,0,1,0
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.000000,360.0,1.0,Rural,N,0,0,1,1,0,2,1
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.000000,360.0,1.0,Urban,Y,0,0,0,0,0,1,0
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.000000,360.0,1.0,Urban,Y,0,0,0,1,1,1,0
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.000000,360.0,1.0,Urban,Y,0,1,0,1,0,1,0

In [9]:
df.Loan_Status.value_counts()

Y    422
N    192
Name: Loan_Status, dtype: int64

In [10]:
#Updated datas in a new dataframe
df1=df[['Gender1','Married1','Dependents1','Education1','Self_Employed1','ApplicantIncome','CoapplicantIncome','LoanAmount','Loan_Amount_Term','Credit_History','Property_Area1','Loan_Status1']]
df1.head()

,Gender1,Married1,Dependents1,Education1,Self_Employed1,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area1,Loan_Status1
0,0,1,0,0,1,5849,0.0,146.412162,360.0,1.0,1,0
1,0,0,1,0,1,4583,1508.0,128.000000,360.0,1.0,2,1
2,0,0,0,0,0,3000,0.0,66.000000,360.0,1.0,1,0
3,0,0,0,1,1,2583,2358.0,120.000000,360.0,1.0,1,0
4,0,1,0,0,1,6000,0.0,141.000000,360.0,1.0,1,0

In [11]:
df1.shape

(614, 12)

In [12]:
df1.dtypes

Gender1                int32
Married1               int32
Dependents1            int32
Education1             int32
Self_Employed1         int32
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area1         int32
Loan_Status1           int32
dtype: object

In [13]:
df1.isnull().sum()

Gender1              0
Married1             0
Dependents1          0
Education1           0
Self_Employed1       0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area1       0
Loan_Status1         0
dtype: int64

In [14]:
df1.shape

(614, 12)

In [15]:
df1

,Gender1,Married1,Dependents1,Education1,Self_Employed1,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area1,Loan_Status1
0,0,1,0,0,1,5849,0.0,146.412162,360.0,1.0,1,0
1,0,0,1,0,1,4583,1508.0,128.000000,360.0,1.0,2,1
2,0,0,0,0,0,3000,0.0,66.000000,360.0,1.0,1,0
3,0,0,0,1,1,2583,2358.0,120.000000,360.0,1.0,1,0
4,0,1,0,0,1,6000,0.0,141.000000,360.0,1.0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
609,1,1,0,0,1,2900,0.0,71.000000,360.0,1.0,2,0
610,0,0,3,0,1,4106,0.0,40.000000,180.0,1.0,2,0
611,0,0,1,0,1,8072,240.0,253.000000,360.0,1.0,1,0
612,0,0,2,0,1,7583,0.0,187.000000,360.0,1.0,1,0
613,1,1,0,0,0,4583,0.0,133.000000,360.0,0.0,0,1

In [16]:
df1.Loan_Status1.value_counts()

0    422
1    192
Name: Loan_Status1, dtype: int64

In [17]:
#Selection independent variables
x=df1.iloc[:,0:11]
x[:5]

,Gender1,Married1,Dependents1,Education1,Self_Employed1,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area1
0,0,1,0,0,1,5849,0.0,146.412162,360.0,1.0,1
1,0,0,1,0,1,4583,1508.0,128.000000,360.0,1.0,2
2,0,0,0,0,0,3000,0.0,66.000000,360.0,1.0,1
3,0,0,0,1,1,2583,2358.0,120.000000,360.0,1.0,1
4,0,1,0,0,1,6000,0.0,141.000000,360.0,1.0,1

In [18]:
#Selection of dependent variables
y=df1.iloc[:,11]
y[:5]

0    0
1    1
2    0
3    0
4    0
Name: Loan_Status1, dtype: int32

In [19]:
x.shape

(614, 11)

In [20]:
y.shape

(614,)

In [21]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.feature_selection import SelectFromModel

In [22]:
#Spliting the dataset for trainning and testing purpouse
from sklearn.model_selection import train_test_split
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.30)

In [23]:
xtrain.shape

(429, 11)

In [24]:
xtrain[:5]

,Gender1,Married1,Dependents1,Education1,Self_Employed1,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area1
611,0,0,1,0,1,8072,240.000000,253.0,360.0,1.0,1
505,0,0,2,0,1,3510,4416.000000,243.0,360.0,1.0,2
422,0,0,0,0,1,1820,1719.000000,100.0,360.0,1.0,1
282,0,0,2,0,1,2301,985.799988,78.0,180.0,1.0,1
116,1,0,0,0,1,3167,2283.000000,154.0,360.0,1.0,0

In [25]:
ytrain.shape

(429,)

In [26]:
ytrain[:5]

611    0
505    0
422    0
282    0
116    0
Name: Loan_Status1, dtype: int32

In [27]:
xtest[:5]

,Gender1,Married1,Dependents1,Education1,Self_Employed1,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area1
342,0,0,1,1,1,4554,1229.0,158.0,360.0,1.0,1
185,0,0,0,0,0,39147,4750.0,120.0,360.0,1.0,0
445,0,0,1,0,0,3466,1210.0,130.0,360.0,1.0,2
368,0,0,1,0,1,6325,0.0,175.0,360.0,1.0,0
46,0,0,1,0,1,5649,0.0,44.0,360.0,1.0,1

In [28]:
ytest[:5]

342    0
185    0
445    0
368    0
46     0
Name: Loan_Status1, dtype: int32

In [29]:
sel = SelectFromModel(RandomForestClassifier(n_estimators = 100))
sel.fit(xtrain, ytrain)

SelectFromModel(estimator=RandomForestClassifier())

In [30]:
sel.get_support()

array([False, False, False, False, False,  True,  True,  True, False,
        True, False])

In [31]:
#Selecting top 4 features for futher working
selected_feat= xtrain.columns[(sel.get_support())]
len(selected_feat)

4

In [32]:
selected_feat

Index(['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount', 'Credit_History'], dtype='object')

In [33]:
#Takeing most important features in a new dataframe
df_top_feature=df1[['ApplicantIncome','CoapplicantIncome','LoanAmount','Loan_Status1','Credit_History']].copy()

In [34]:
df_top_feature.head(20)

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Status1,Credit_History
0,5849,0.0,146.412162,0,1.000000
1,4583,1508.0,128.000000,1,1.000000
2,3000,0.0,66.000000,0,1.000000
3,2583,2358.0,120.000000,0,1.000000
4,6000,0.0,141.000000,0,1.000000
5,5417,4196.0,267.000000,0,1.000000
6,2333,1516.0,95.000000,0,1.000000
7,3036,2504.0,158.000000,1,0.000000
8,4006,1526.0,168.000000,0,1.000000
9,12841,10968.0,349.000000,1,1.000000
10,3200,700.0,70.000000,0,1.000000
11,2500,1840.0,109.000000,0,1.000000
12,3073,8106.0,200.000000,0,1.000000
13,1853,2840.0,114.000000,1,1.000000
14,1299,1086.0,17.000000,0,1.000000
15,4950,0.0,125.000000,0,1.000000
16,3596,0.0,100.000000,0,0.842199
17,3510,0.0,76.000000,1,0.000000
18,4887,0.0,133.000000,1,1.000000
19,2600,3500.0,115.000000,0,1.000000

In [35]:
df_top_feature1=df1[['ApplicantIncome','CoapplicantIncome','LoanAmount','Credit_History']].copy()
df_top_feature1.head()

   ApplicantIncome  CoapplicantIncome  LoanAmount  Credit_History
0             5849                0.0  146.412162             1.0
1             4583             1508.0  128.000000             1.0
2             3000                0.0   66.000000             1.0
3             2583             2358.0  120.000000             1.0
4             6000                0.0  141.000000             1.0

In [36]:
x=df_top_feature.drop('Loan_Status1',axis=1)
x[:5]

   ApplicantIncome  CoapplicantIncome  LoanAmount  Credit_History
0             5849                0.0  146.412162             1.0
1             4583             1508.0  128.000000             1.0
2             3000                0.0   66.000000             1.0
3             2583             2358.0  120.000000             1.0
4             6000                0.0  141.000000             1.0

In [37]:
x.dtypes

ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Credit_History       float64
dtype: object

In [38]:
y=df_top_feature['Loan_Status1']
y[:5]

0    0
1    1
2    0
3    0
4    0
Name: Loan_Status1, dtype: int32

### Dataset Standardrising

In [39]:
#Standarising the dataset
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x=sc.fit_transform(x)
x

array([[ 0.07299082, -0.55448733,  0.        ,  0.45164045],
       [-0.13441195, -0.03873155, -0.21927331,  0.45164045],
       [-0.39374734, -0.55448733, -0.957641  ,  0.45164045],
       ...,
       [ 0.43717437, -0.47240418,  1.26937121,  0.45164045],
       [ 0.35706382, -0.55448733,  0.4833669 ,  0.45164045],
       [-0.13441195, -0.55448733, -0.15972753, -2.41044061]])

In [40]:
from sklearn.model_selection import train_test_split
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.30)

### Applying Logistic Regression

In [41]:
from sklearn.linear_model import LogisticRegression
lg=LogisticRegression()
lg.fit(xtrain,ytrain)

LogisticRegression()

In [42]:
lg_pred=lg.predict(xtest)

In [43]:
from sklearn.metrics import accuracy_score
accuracy_score(ytest,lg_pred)*100

81.62162162162161

### Applying Decession Tree model

In [44]:
from sklearn.tree import DecisionTreeClassifier
dt=DecisionTreeClassifier(criterion='entropy',max_depth=3)
dt.fit(xtrain,ytrain)

DecisionTreeClassifier(criterion='entropy', max_depth=3)

In [45]:
dt_pred=dt.predict(xtest)

In [46]:
from sklearn.metrics import accuracy_score
accuracy_score(ytest,dt_pred)*100

81.62162162162161

### Applying Naive Bayse Model

In [47]:
from sklearn.naive_bayes import GaussianNB
gb=GaussianNB()
gb.fit(xtrain,ytrain)
gb_pred=gb.predict(xtest)

In [48]:
from sklearn.metrics import accuracy_score
accuracy_score(ytest,gb_pred)*100

81.08108108108108

### Applying Knn model

In [49]:
from sklearn.neighbors import KNeighborsClassifier
kn=KNeighborsClassifier()
kn.fit(xtrain,ytrain)
kn_pred=kn.predict(xtest)

In [50]:
accuracy_score(ytest,kn_pred)*100

79.45945945945945

### User input

In [51]:
df_top_feature.columns

Index(['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount', 'Loan_Status1',
       'Credit_History'],
      dtype='object')

In [52]:
df_top_feature['Credit_History'].dtype

dtype('float64')

In [53]:
print("Pls provide the datas for checking loan eligibility...")
ai=int(input("Enter applicant income:"))
ci=float(input("Enter CoapplicantIncome:"))
la=float(input("Enter LoanAmount:"))
ch=float(input("Enter Credit_History:"))
li=[]
li.append(ai)
li.append(ci)
li.append(la)
li.append(ch)
print(li)
s=sum(lg.predict([li]))
print(s)
if (s==0):
     print("Applicant is eligible for loan...")
else:
     print("Applicant is not eligible for loan...")

Pls provide the datas for checking loan eligibility...
Enter applicant income:1000
Enter CoapplicantIncome:2000
Enter LoanAmount:2000
Enter Credit_History:1
[1000, 2000.0, 2000.0, 1.0]
1
Applicant is not eligible for loan...